ferdiu/ESP32ProvisionToolkit/src/ESP32_WiFiProvisioner.cpp
bool ESP32_WiFiProvisioner::loadCredentials() {
    if (!_preferences.begin(NVS_NAMESPACE, true)) {
        log(LOG_ERROR, "Failed to open NVS");
        return false;
    }

    _storedSSID = _preferences.getString(NVS_SSID, "");
    _storedPassword = _preferences.getString(NVS_PASSWORD, "");

    _preferences.end();

    bool hasCredentials = _storedSSID.length() > 0;
    log(LOG_DEBUG, "Loaded credentials: SSID=%s, hasPassword=%d",
        _storedSSID.c_str(), _storedPassword.length() > 0);

    return hasCredentials;
}

bool ESP32_WiFiProvisioner::saveCredentials(const String& ssid, const String& password) {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        log(LOG_ERROR, "Failed to open NVS for writing");
        return false;
    }

    _preferences.putString(NVS_SSID, ssid);
    _preferences.putString(NVS_PASSWORD, password);

    _preferences.end();

    _storedSSID = ssid;
    _storedPassword = password;

    return true;
}

bool ESP32_WiFiProvisioner::loadResetPassword() {
    if (!_preferences.begin(NVS_NAMESPACE, true)) {
        return false;
    }

    _resetPassword = _preferences.getString(NVS_RESET_PWD, "");
    _preferences.end();

    return _resetPassword.length() > 0;
}

bool ESP32_WiFiProvisioner::saveResetPassword(const String& password) {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        return false;
    }

    String hash = hashPassword(password);
    _preferences.putString(NVS_RESET_PWD, hash);
    _preferences.end();

    _resetPassword = hash;

    return true;
}

void ESP32_WiFiProvisioner::clearAllCredentials() {
    if (_preferences.begin(NVS_NAMESPACE, false)) {
        _preferences.clear();
        _preferences.end();
    }

    _storedSSID = "";
    _storedPassword = "";
    _resetPassword = "";
}

// ===== State Machine =====

void ESP32_WiFiProvisioner::handleStateInit() {
    _state = STATE_LOAD_CONFIG;
}

void ESP32_WiFiProvisioner::handleStateLoadConfig() {
    if (loadCredentials()) {
        log(LOG_INFO, "Found stored credentials for: %s", _storedSSID.c_str());
        _retryCount = 0;
        _state = STATE_CONNECTING;
        setLEDPattern(100, 900); // Slow blink
    } else {
        log(LOG_INFO, "No credentials found, entering provisioning mode");
        _state = STATE_PROVISIONING;
    }
}

void ESP32_WiFiProvisioner::handleStateConnecting() {
    if (connectToWiFi()) {
        log(LOG_INFO, "Connected to WiFi: %s", _storedSSID.c_str());
        log(LOG_INFO, "IP Address: %s", WiFi.localIP().toString().c_str());

        // Setup mDNS if enabled
        if (_config.mdnsEnabled) {
            if (MDNS.begin(_config.mdnsName.c_str())) {
                log(LOG_INFO, "mDNS responder started: %s.local", _config.mdnsName.c_str());
            }
        }

        _state = STATE_CONNECTED;
        setLEDPattern(0, 0); // Solid on

        // Start minimal web server if reset is enabled
        startConnectedWebServer();

        if (_onConnectedCallback) {
            _onConnectedCallback();
        }
    } else {
        _state = STATE_RETRY_WAIT;
        _lastRetryTime = millis();
    }
}

void ESP32_WiFiProvisioner::handleStateConnected() {
    // Client handling
    if (_webServer) {
        _webServer->handleClient();
    }

    // Check if still connected
    if (WiFi.status() != WL_CONNECTED) {
        log(LOG_ERROR, "WiFi connection lost");
        _retryCount = 0;
        _state = STATE_CONNECTING;
        setLEDPattern(100, 900);
    }
}

void ESP32_WiFiProvisioner::handleStateRetryWait() {
    if (millis() - _lastRetryTime >= _config.retryDelay) {
        _retryCount++;

        log(LOG_INFO, "Retry %d/%d", _retryCount, _config.maxRetries);

        if (_retryCount >= _config.maxRetries) {
            log(LOG_ERROR, "Max retries exceeded");

            if (_onFailedCallback) {
                _onFailedCallback(_retryCount);
            }

            if (_config.autoWipeOnMaxRetries) {
                log(LOG_INFO, "Auto-wiping credentials");
                clearAllCredentials();
                _state = STATE_PROVISIONING;
            } else {
                // Keep retrying
                _retryCount = 0;
                _state = STATE_CONNECTING;
            }
        } else {
            _state = STATE_CONNECTING;
        }
    }
}

void ESP32_WiFiProvisioner::handleStateProvisioning() {
    startProvisioningMode();
    _state = STATE_PROVISIONING_ACTIVE;
}

void ESP32_WiFiProvisioner::handleStateProvisioningActive() {
    // Handle DNS requests
    if (_dnsServer) {
        _dnsServer->processNextRequest();
    }

    // Handle web requests
    if (_webServer) {
        _webServer->handleClient();
    }

    // Check timeout
    if (_config.apTimeout > 0 && millis() - _apStartTime >= _config.apTimeout) {
        log(LOG_INFO, "AP timeout reached");
        stopProvisioningMode();

        // Retry connection if we have credentials
        if (_storedSSID.length() > 0) {
            _state = STATE_CONNECTING;
        }
    }
}

// ===== Connection =====

bool ESP32_WiFiProvisioner::connectToWiFi() {
    WiFi.mode(WIFI_STA);
    WiFi.begin(_storedSSID.c_str(), _storedPassword.c_str());

    unsigned long startAttempt = millis();
    const unsigned long timeout = 10000; // 10 second timeout per attempt

    while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < timeout) {
        delay(100);
    }

    return WiFi.status() == WL_CONNECTED;
}

void ESP32_WiFiProvisioner::disconnectWiFi() {
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
}

// ===== Provisioning =====

void ESP32_WiFiProvisioner::startProvisioningMode() {
    log(LOG_INFO, "Starting provisioning mode");

    // Stop any existing connection
    disconnectWiFi();

    // Stop any existing webserver
    stopWebServer();

    // Create unique AP name
    String apName = _config.apName + "-" + getMACAddress().substring(9);
    apName.replace(":", "");

    // Start AP
    WiFi.mode(WIFI_AP);

    if (_config.apPassword.length() > 0) {
        WiFi.softAP(apName.c_str(), _config.apPassword.c_str());
        log(LOG_INFO, "AP started: %s (password protected)", apName.c_str());
    } else {
        WiFi.softAP(apName.c_str());
        log(LOG_INFO, "AP started: %s (open network)", apName.c_str());
    }

    IPAddress apIP = WiFi.softAPIP();
    log(LOG_INFO, "AP IP: %s", apIP.toString().c_str());

    // Start DNS server for captive portal
    if (!_dnsServer) {
        _dnsServer = new DNSServer();
    }
    _dnsServer->start(DNS_PORT, "*", apIP);

    // Load reset password if needed
    if (_config.httpResetAuthRequired) {
        loadResetPassword();
    }

    // Start web server
    setupWebServerProvisioningMode();

    _apStartTime = millis();
    setLEDPattern(100, 100); // Fast blink

