ferdiu/ESP32ProvisionToolkit/src/ESP32_WiFiProvisioner.cpp
    if (_onAPModeCallback) {
        _onAPModeCallback(apName.c_str(), apIP.toString().c_str());
    }
}

void ESP32_WiFiProvisioner::stopProvisioningMode() {
    log(LOG_INFO, "Stopping provisioning mode");

    if (_dnsServer) {
        _dnsServer->stop();
    }

    stopWebServer();

    WiFi.softAPdisconnect(true);
}

void ESP32_WiFiProvisioner::setupWebServerProvisioningMode() {
    if (!_webServer) {
        _webServer = new WebServer(WEB_SERVER_PORT);
    }

    _webServer->on("/", HTTP_GET, staticHandleRoot);
    _webServer->on("/scan", HTTP_GET, staticHandleScan);
    _webServer->on("/save", HTTP_POST, staticHandleSave);

    // This avoid captive portals redirect after form submission
    _webServer->on("/save", HTTP_GET, staticHandleSaveGet);

    if (_config.httpResetEnabled) {
        _webServer->on("/reset", HTTP_POST, staticHandleReset);
    }

    registerCustomRoutes(ROUTE_PROVISIONING_ONLY);

    _webServer->onNotFound(staticHandleNotFound);

    _webServer->begin();
    log(LOG_INFO, "Web server started on port %d", WEB_SERVER_PORT);
}

// ===== Web Server Handlers =====

void ESP32_WiFiProvisioner::handleRoot() {
    String html = generateHTML();
    _webServer->send(200, "text/html", html);
}

void ESP32_WiFiProvisioner::handleScan() {
    log(LOG_DEBUG, "Scanning for networks...");

    int n = WiFi.scanNetworks();
    String json = "[";

    for (int i = 0; i < n; i++) {
        if (i > 0) json += ",";
        json += "{";
        json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
        json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
        json += "\"secure\":" + String(WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? "true" : "false");
        json += "}";
    }

    json += "]";

    WiFi.scanDelete();

    _webServer->send(200, "application/json", json);
}

void ESP32_WiFiProvisioner::handleSave() {
    String ssid = _webServer->arg("ssid");
    String password = _webServer->arg("password");
    String resetPwd = _webServer->arg("reset_password");

    log(LOG_INFO, "Received configuration: SSID=%s", ssid.c_str());

    if (ssid.length() == 0) {
        _webServer->send(400, "text/plain", "SSID is required");
        return;
    }

    // Save WiFi credentials
    if (!saveCredentials(ssid, password)) {
        _webServer->send(500, "text/plain", "Failed to save credentials");
        return;
    }

    // Save reset password if authentication is enabled
    if (_config.httpResetAuthRequired && resetPwd.length() > 0) {
        saveResetPassword(resetPwd);
    }

    _webServer->send(200, "text/plain", "Configuration saved. Rebooting...");

    log(LOG_INFO, "Configuration saved, rebooting in 2 seconds");
    delay(2000);
    ESP.restart();
}

void ESP32_WiFiProvisioner::handleSaveGet() {
    log(LOG_INFO, "Sending saved status to the client");
    _webServer->send(200, "text/plain", "OK");
}

void ESP32_WiFiProvisioner::handleReset() {
    if (!_config.httpResetEnabled) {
        _webServer->send(403, "text/plain", "Reset disabled");
        return;
    }

    // Check authentication if required
    if (_config.httpResetAuthRequired) {
        String password = _webServer->arg("password");

        if (password.length() == 0) {
            _webServer->send(401, "text/plain", "Password required");
            return;
        }

        if (!verifyPassword(password, _resetPassword)) {
            log(LOG_ERROR, "Reset authentication failed");
            _webServer->send(401, "text/plain", "Invalid password");
            return;
        }
    }

    log(LOG_INFO, "HTTP reset triggered");

    _webServer->send(200, "text/plain", "Resetting device...");

    delay(1000);
    performReset("HTTP reset");
}

void ESP32_WiFiProvisioner::handleNotFound() {
    log(LOG_DEBUG, "NotFound: %s %s",
        _webServer->method() == HTTP_GET ? "GET" : "POST",
        _webServer->uri().c_str());

    // Captive portal redirect
    _webServer->sendHeader("Location", "/", true);
    _webServer->send(302, "text/plain", "");
}

// Static web server handlers
void ESP32_WiFiProvisioner::staticHandleRoot() {
    if (_instance) _instance->handleRoot();
}

void ESP32_WiFiProvisioner::staticHandleScan() {
    if (_instance) _instance->handleScan();
}

void ESP32_WiFiProvisioner::staticHandleSave() {
    if (_instance) _instance->handleSave();
}

void ESP32_WiFiProvisioner::staticHandleSaveGet() {
    if (_instance) _instance->handleSaveGet();
}

void ESP32_WiFiProvisioner::staticHandleReset() {
    if (_instance) _instance->handleReset();
}

void ESP32_WiFiProvisioner::staticHandleNotFound() {
    if (_instance) _instance->handleNotFound();
}

// ===== Reset Mechanisms =====

void ESP32_WiFiProvisioner::checkHardwareReset() {
    bool buttonState = digitalRead(_config.resetButtonPin);
    bool isPressed = _config.resetButtonActiveLow ? (buttonState == LOW) : (buttonState == HIGH);

    if (isPressed && !_buttonPressed) {
        // Button just pressed
        _buttonPressed = true;
        _buttonPressStart = millis();
    } else if (isPressed && _buttonPressed) {
        // Button still pressed, check duration
        if (millis() - _buttonPressStart >= _config.resetButtonDuration) {
            log(LOG_INFO, "Hardware reset button held for %lu ms", _config.resetButtonDuration);
            performReset("Hardware button");
        }
    } else if (!isPressed && _buttonPressed) {
        // Button released before threshold
        _buttonPressed = false;
    }
}

void ESP32_WiFiProvisioner::checkDoubleReboot() {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        return;
    }

    uint32_t bootCount = _preferences.getUInt(NVS_BOOT_COUNT, 0);
    uint32_t lastBootTime = _preferences.getUInt(NVS_BOOT_TIME, 0);
    uint32_t currentTime = millis();

    bootCount++;
    _preferences.putUInt(NVS_BOOT_COUNT, bootCount);
    _preferences.putUInt(NVS_BOOT_TIME, currentTime);

    log(LOG_DEBUG, "Boot count: %u, last boot: %u ms ago", bootCount, currentTime - lastBootTime);

    // Check if this is a double reboot
    if (bootCount >= 2 && (currentTime - lastBootTime) < _config.doubleRebootWindow) {
        log(LOG_INFO, "Double reboot detected, clearing credentials");
        clearAllCredentials();
        _preferences.putUInt(NVS_BOOT_COUNT, 0);
    }

    _preferences.end();

    // Schedule boot count reset
    // This would normally be done with a timer, but we'll handle it in the main loop
}

void ESP32_WiFiProvisioner::performReset(const char* reason) {
    log(LOG_INFO, "Performing reset: %s", reason);

    if (_onResetCallback) {
        _onResetCallback();
    }

    clearAllCredentials();
    delay(500);
    ESP.restart();
}

